# https://github.com/Homebrew/homebrew-bundle

# add taps
tap "earthly/earthly"
tap "homebrew/bundle"
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap "homebrew/core"
tap 'homebrew/services'

# Install packages
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'htop'
brew 'brew-cask-completion'
brew 'cmake'
brew 'chezmoi'
brew 'croc'
brew 'curl'
brew 'go'
brew 'golangci-lint'
brew 'git'
brew 'jq'
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'pgcli'
brew 'ripgrep'
brew 'tmux'
brew 'tldr'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Bloomin' Labs
brew 'act'
brew 'consul'
brew 'earthly'
brew 'terraform'
brew 'tailscale'
brew 'envconsul'
brew 'k6'
brew 'stripe/stripe-cli/stripe'
brew 'consul-template'
brew 'nomad'
brew 'pulumi'
brew 'vault'
brew 'earthly/earthly/earthly'

# Install casks
cask 'balenaetcher'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'figma'
cask 'google-drive'
cask 'google-chrome'
cask 'iterm2'
cask 'dbeaver-community'
cask 'insomnia'
cask 'mactex'
cask 'marvin'
cask 'notion'
cask 'private-internet-access'
cask 'spotify'
cask 'skim'
cask 'vlc'
cask 'visual-studio-code'
