# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

# add taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# Install packages
brew 'bash'
brew 'bash-completion'
brew 'clang-format'
brew 'cmake'
brew 'consul'
brew 'earthly'
brew 'exa'
brew 'fzf'
brew 'go'
brew 'git'
brew 'neovim'
brew 'nvm'
brew 'node'
brew 'pgcli'
brew 'pipenv'
brew 'pyenv'
brew 'python3'
brew 'pulumi'
brew 'ripgrep'
brew 'stripe'
brew 'tmux'
brew 'tldr'
brew 'wget'
brew 'yadm'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'


# Install casks
cask 'balenaetcher'
cask 'bitbar'
cask 'bitwarden'
cask 'daisydisk'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'figma'
cask 'google-drive'
cask 'google-chrome'
cask 'iterm2'
cask 'insomnia'
cask 'mactex'
cask 'notion'
cask 'postico'
cask 'private-internet-access'
cask 'spotify'
cask 'skim'
cask 'transmission'
cask 'vagrant'
cask 'vlc'
cask 'visual-studio-code'
vask 'virtualbox'
