# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

# add taps
homebrew/cask
homebrew/cask-fonts
homebrew/services

# Install packages
brew 'bash'
brew 'bash-completion'
brew 'clang-format'
brew 'cmake'
brew 'exa'
brew 'fzf'
brew 'git'
brew 'neovim'
brew 'nvm'
brew 'pgcli'
brew 'pipenv'
brew 'prettier'
brew 'pyenv'
brew 'python3'
brew 'ripgrep'
brew 'skhd'
brew 'tmuxinator'
brew 'yadm'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'node'
brew 'wget'


# Install casks
cask 'vlc'
cask 'google-chrome'
cask 'spotify'
cask 'iterm2'
cask 'google-backup-and-sync'
cask 'firefox-beta'
cask 'discord'
cask 'docker'
cask 'mactex'
cask 'skim'
cask 'transmission'
cask 'altair-graphql-client'
cask 'bitbar'
cask 'bitwarden'
cask 'daisydisk'
cask 'figma'
cask 'insomnia'
cask 'microsoft-excel'
cask 'microsoft-word'
cask 'microsoft-powerpoint'
cask 'notion'
cask 'qgroundcontrol'
cask 'teamviewer'
cask 'visual-studio-code'
cask 'balenaetcher'
cask 'font-hack-nerd-font'
# Need to install nirvana, yabai, bitbar yabai extension
